app/views/users/show.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
            <td><%= book.body %></td>
            <td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>
            <td><%= book.favorites.count %>いいね</td>