app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
      <%= @book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
      <%= @book.favorites.count %> いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
    <div class="float-wrapper">
      <h4 class="comment-count"><%= @book.book_comments.count %>件コメント</h4>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
    <table class="table table-condensed">
      <% @book.book_comments.each do |book_comment| %>