app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["user_id", 1], ["created_at", "2020-04-25 04:57:44.980841"], ["updated_at", "2020-04-25 04:57:44.980841"]]

  def index
    @user = current_user
    @users = User.all
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    @new_book = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]